[{"id":1698693251,"title":"Doctor Who season 14: Release date speculation, cast, and latest news","image":"https:\/\/images.immediate.co.uk\/production\/volatile\/sites\/3\/2022\/11\/Fifteenth-Doctor-7658f22.jpeg?quality=90&webp=true&fit=1100,1375","category":"serie","content":"The future is bright for Doctor Who as we approach the 60th-anniversary specials and what comes next.\r\n\r\nThe actor, who previously starred as Eric Effiong in Sex Education, was announced as the top name of RadioTimes.com's TV 100 earlier this year, beating a whole host of influential TV stars to the top spot, and it's clear his star is only going to keep shining.\r\n\r\nChatting to RadioTimes.com earlier this year to celebrate the news, Gatwa then gave a very welcome update on how filming for season 14 is going, teasing: \"Filming is going great. [It] was a tough start as I was doing Sex Education and Doctor Who at the same time for two months at the beginning.\r\n\r\n\"But now that Sex Ed is wrapped and I'm just in Doctor, it has been so much fun having full rein to explore and find the character. It truly is the funnest role and the action never stops.\"\r\n\r\nFilming has wrapped on the fourteenth season but the show is already filming its fifteenth season.\r\n\r\nFilming officially began for the specials December 2022, with Gatwa set to take over following the 60th anniversary specials, starring David Tennant and Catherine Tate, and helmed by returning showrunner Russell T Davies.\r\n\r\nSo, when exactly can we expect season 14 of the popular sci-fi show? Read on for everything you need to know."},{"id":1698761018,"title":"Secretaries of state and defense to testify as Congress grapples with Biden&rsquo;s security funding request","image":"https:\/\/media-cldnry.s-nbcnews.com\/image\/upload\/t_fit-1240w,f_auto,q_auto:best\/rockcms\/2023-10\/231030-israel-gaza-mn-1635-5ce0af.jpg","category":"politic","content":"WASHINGTON &mdash; The House and the Senate are at odds over how to proceed with President Joe Biden&rsquo;s sweeping funding request for foreign aid and national security goals.\r\n\r\nOn Tuesday, Senate Democrats will seek to bolster their position at a hearing titled &ldquo;A Review of the National Security Supplemental Request,&rdquo; where Secretary of State Antony Blinken and Defense Secretary Lloyd Austin are expected to make their case for fully funding the new spending package.\r\n\r\nTheir testimony before the Senate Appropriations Committee is expected to be critical in the Democratic-led Senate&rsquo;s crafting and passing a bill to respond to the administration's $105 billion request, covering aid to Ukraine and Israel, efforts to contain China and tougher border security in the U.S."},{"id":1698761367,"title":"A new Covid variant has become dominant amid slow uptake of the updated shots","image":"https:\/\/media-cldnry.s-nbcnews.com\/image\/upload\/t_fit-1240w,f_auto,q_auto:best\/rockcms\/2023-10\/231027-covid-flu-vaccine-ew-153p-baae1f.jpg","category":"health","content":"A new Covid variant has become dominant in the U.S., but relatively few people have thus far gotten the new shots that could offer some protection against it.\r\n\r\nThe variant, called HV.1, replaced EG.5 as the country's most prevalent this week, according to data released Friday by the Centers for Disease Control and Prevention.\r\n\r\nThe two variants are genetically similar versions of omicron.\r\n\r\nHV.1 makes up around 25% of Covid cases now, up from around 1% at the beginning of August. EG.5, meanwhile, represents nearly 22% of cases, down from 24% at the start of the month.\r\n\r\nBoth are descendants of the XBB variant. The updated Covid vaccines from Pfizer and Moderna, which became available last month, target a different XBB descendant, called XBB.1.5.\r\n\r\nBut disease experts say the new shots should offer cross-protection against the currently dominant strains. Dr. Scott Roberts, an infectious disease specialist at Yale Medicine, said that although the vaccine is not a \"perfect match\" for HV.1, \"it&rsquo;s still a good match because it&rsquo;s still within the same family of variant.\"\r\n\r\nHowever, just around 3.5 % of the U.S. population &mdash; approximately 12 million people &mdash; have received the new Covid shots since they became available in mid-September, a CDC spokesperson said. He cautioned that the number is a rough estimate because states are no longer required to report vaccination numbers.\r\n\r\n\"I hope uptick increases, but I&rsquo;m pretty pessimistic,\" Roberts said. \"I don&rsquo;t think we&rsquo;ll hit anywhere near the levels we had last year.\"\r\n\r\nA few factors have hindered this season's vaccine rollout. On top of the issues of accessibility and hesitancy seen in past vaccination campaigns, this was the first time such vaccines were part of the commercial market instead of being ordered, distributed and funded by the federal government.\r\n\r\n\"The logistic complications certainly were not helpful, but I think that the low uptake is more than that. The low uptake reflects that most of the public is no longer concerned about Covid,\" said Dr. Dan Barouch, director of the Center for Virology and Vaccine Research at Beth Israel Deaconess Medical Center in Boston."},{"id":1698763164,"title":"Marvel&#039;s Spider-Man 2 devs seemingly tease Daredevil video game","image":"https:\/\/images.ladbible.com\/resize?type=webp&quality=70&width=720&fit=contain&gravity=null&url=https:\/\/images.ladbiblegroup.com\/v3\/assets\/bltbc1876152fcd9f07\/blt21280212cb3e311f\/6540d692be7413040af74215\/marvel_spider-man_daredevil.png","category":"gaming","content":"In what has been an incredible year for video game releases, even the likes of Marvel&rsquo;s Spider-Man 2 has some strong contenders for the prestigious 2023 Game of the Year accolade.\r\n\r\nDeveloped by Insomniac Games, Marvel&rsquo;s Spider-Man 2 delivers just about every we&rsquo;d want in a sequel. It improves the gameplay, it looks even nicer and we have a larger map of New York City to freely explore. Oh, and we can also switch on the fly between both Peter Parker and Miles Morales."},{"id":1698763371,"title":"How giant mirrors are made for what will be the world&rsquo;s largest telescope","image":"https:\/\/www.sciencenews.org\/wp-content\/uploads\/2023\/10\/101723_no_massive-telescope_feat-1380x776.jpeg","category":"science","content":"TUCSON &mdash; Hot and dry air, perfused with a scent reminiscent of a warmed hair straightener, stuffed a hangar-sized room beneath the football stadium at the University of Arizona. The space, part of the Richard F. Caris Mirror Lab, was dominated by a gyrating, carousel-sized furnace, fire truck red and shaped like a flying saucer. The swirling cocoon of a colossal light collector.\r\n\r\n&ldquo;It&rsquo;s making 4.9 revolutions per minute,&rdquo; says astronomer Buell Januzzi of the University of Arizona, raising his voice over the lab&rsquo;s droning ventilation system. About half past noon on October 7, after about a week of gradual warming, the temperature inside the rotating machine had finally peaked at 1165&deg; Celsius."},{"id":1698763512,"title":"Elon Musk and X a year on: Four problems he needs to fix","image":"https:\/\/ichef.bbci.co.uk\/news\/976\/cpsprodpb\/2BF5\/production\/_131535211_elon_musk_getty.jpg.webp","category":"technology","content":"A year ago, having just bought Twitter, Elon Musk walked into its HQ carrying a sink. \"Let that sink in\" he quipped - then fired a large swathe of staff.\r\n\r\nIt was the first flavour of what has been a 12-month whirlwind of erratic change - not least the renaming of the company to X.\r\n\r\nIn some ways, X has been remarkably resilient. Despite rivals old and new circling, it survives.\r\n\r\nHowever, with advertisers wary and user metrics shaky, what's next for X?"},{"id":1698769045,"title":"Prime Video announced their highly-anticipated new series Fallout","image":"https:\/\/prd-rteditorial.s3.us-west-2.amazonaws.com\/wp-content\/uploads\/2023\/10\/23103632\/fallout-date-announcement-700x380-1.jpg","category":"serie","content":"Prime Video announced their highly-anticipated new series Fallout will premiere exclusively on April 12, 2024. Based on the best-selling global video game franchise, the live-action is set in future post-apocalyptic Los Angeles and the world of Fallout, where citizens must hide in underground bunkers to protect themselves from radiation, bandits and mutants after nuclear devastation. The original series stars Ella Purnell, Walton Goggins, Aaron Moten, Kyle MacLachlan, and Xelia Mendes-Jones, along with Moises Arias, Johnny Pemberton, Aixa Kendrick, Leer Leary, Dave Register, and Rodrigo Luzzi. The premiere date announcement and launch of the series&rsquo; official social channels was made in honor of the 26th anniversary of Fallout Day, an annual celebration of the award-winning and best-selling Fallout franchise. Geneva Robertson-Dworet and Graham Wagner serve as executive producers, writers and co-showrunners. The series comes from Kilter Films and executive producers Jonathan Nolan and Lisa Joy, the creators of Westworld. It will be available to stream exclusively on Prime Video in more than 240 countries and territories worldwide."},{"id":1698769171,"title":"Daniel Dae Kim as Ozai in season 1 of Avatar: The Last Airbender","image":"https:\/\/prd-rteditorial.s3.us-west-2.amazonaws.com\/wp-content\/uploads\/2023\/10\/17144314\/Avatar-The-Last-Airbender-Book-1-Fire-Nation_2-700x380-1.jpg","category":"serie","content":"Netflix released first-look photos of the Fire Nation from its live-action series Avatar: The Last Airbender: Daniel Dae Kim as Fire Lord Ozai, Paul Sun-Hyung Lee as General Iroh, Ken Leung as Commander Zhao, Elizabeth Yu as Princess Azula, and a new image of Dallas Liu as Prince Zuko. Premiering in 2024, the show is based on the hit animated series that follows Aang (Gordon Cormier), a young Air Nomad &mdash; the last of his kind &mdash; as he learns to master the four elements (Water, Earth, Fire and Air) to restore balance to a world. After the Fire Nation attacks and wipes out the Air Nomads, Aang reawakens to take his rightful place as the next Avatar. Alongside his newfound friends Sokka (Ian Ousley) and Katara (Kiawentiio) &mdash; siblings and members of the Southern Water Tribe &mdash; Aang embarks on a quest to save the world."},{"id":1698769309,"title":"CNN Poll: Trump dominates South Carolina GOP primary, with Haley a clear but distant second","image":"https:\/\/media.cnn.com\/api\/v1\/images\/stellar\/prod\/2023-08-06t013925z-1600968756-rc21i2a1cs5r-rtrmadp-3-usa-election-trump.JPG?c=16x9&q=h_720,w_1280,c_fill\/f_webp","category":"politic","content":"Former President Donald Trump currently holds majority support in the early primary state of South Carolina, where his strongest challenger is Nikki Haley, the state&rsquo;s former governor, according to a new CNN poll conducted by SSRS.\r\n\r\nFifty-three percent of likely Republican primary voters in South Carolina call Trump their first choice for the 2024 GOP presidential nomination, with 22% picking Haley and 11% backing Florida Gov. Ron DeSantis. South Carolina Sen. Tim Scott, whose campaign is currently focused on Iowa more than his home state, follows at 6%. No other candidate saw more than 2% support.\r\n\r\nSouth Carolina is one of the earliest contests on the GOP nominating calendar next year, holding its Republican primary on February 24 after Iowa, New Hampshire and Nevada. Trump&rsquo;s support in South Carolina, though broad, falls slightly shy of his even wider leads over the field in recent CNN polls nationally and in Nevada. Recent polling in New Hampshire and Iowa from CNN and others, though, finds Trump with narrower support in those two states, where several of his rivals are hoping a strong showing will dent his support in later contests such as South Carolina&rsquo;s.\r\n\r\nBut, echoing the dynamics of the primary campaign nationally, Trump&rsquo;s base of support in South Carolina is far more solid than his rivals&rsquo; pool of core supporters. An 82% majority of his current backers say that they&rsquo;ll definitely support him. Just 42% of Haley&rsquo;s supporters and 38% of DeSantis&rsquo; backers say they&rsquo;re certain they won&rsquo;t change their minds.\r\n\r\nMany of the demographic and ideological divides present at the national level hold true in the state as well. Trump leads Haley by 50 percentage points among likely voters without a college degree (66% to 16%) and by 40 points among Republicans (59% to 19%). By contrast, Trump and Haley are tied among college graduates (32% support each) and see similar levels of support among independents who say they&rsquo;re likely to vote in the GOP primary (38% back Trump, 34% Haley)."},{"id":1698769509,"title":"Mideast crisis will test whether Biden can make experience an asset","image":"https:\/\/media.cnn.com\/api\/v1\/images\/stellar\/prod\/231019200924-03-biden-address-1019.jpg?c=16x9&q=h_720,w_1280,c_fill\/f_webp","category":"politic","content":"The escalating confrontation between Israel and Hamas is offering President Joe Biden a crucial opportunity to begin flipping the script on one of his most glaring vulnerabilities in the 2024 presidential race.\r\n\r\nFor months, polls have consistently shown that most Americans believe Biden&rsquo;s advanced age has diminished his capacity to handle the responsibilities of the presidency. But many Democrats believe that Biden&rsquo;s widely praised response to the Mideast crisis could provide him a pivot point to argue that his age is an asset because it has equipped him with the experience to navigate such a complex challenge.\r\n\r\n&ldquo;As you project forward, we are going to be able to argue that Joe Biden&rsquo;s age has been central to his success because in a time of Covid, insurrection, Russian invasion of Ukraine, now challenges in the Middle East, we have the most experienced man ever as president,&rdquo; said Democratic strategist Simon Rosenberg. &ldquo;Perhaps having the most experienced person ever to go into the Oval Office was a blessing for the country. I think we are going to be able to make that argument forcefully.&rdquo;\r\n\r\nBiden unquestionably faces a steep climb to ameliorate the concern that he&rsquo;s too old for the job. Political strategists in both parties agree that those public perceptions are largely rooted in reactions to his physical appearance &ndash; particularly the stiffness of his walk and softness of his voice &ndash; and thus may be difficult to reverse with arguments about his performance. In a CNN poll released last month, about three-fourths of adults said Biden did not have &ldquo;the stamina and sharpness to serve effectively as president&rdquo; and nearly as many said he does not inspire confidence. Even about half of Democrats said Biden lacked enough stamina and sharpness and did not inspire confidence, with a preponderant majority of Democrats younger than 45 expressing those critical views.\r\n\r\nBut the crisis in Israel shows the path Biden will probably need to follow if there&rsquo;s any chance for him to transmute doubts about his age into confidence in his experience. Though critics on the left and right in American politics have raised objections, Biden&rsquo;s response to the Hamas attack has drawn praise as both resolute and measured from a broad range of leaders across the ideological spectrum in both the US and Israel.\r\n\r\n&ldquo;Biden is in his element here where relationships matter and his team is experienced (meaning operationally effective) and thoughtful (meaning can see forests as well as trees),&rdquo; James Steinberg, dean of the Johns Hopkins School of Advanced International Studies, and deputy secretary of state under former President Barack Obama, wrote in an email.\r\n\r\nSimilarly, David Friedman, who served as ambassador to Israel for then-President Donald Trump, declared late last week, on Fox News Channel no less, that &ldquo;The Biden administration over the past 12-13 days has been great.&rdquo;\r\n\r\nThese responses underscore the fundamental political paradox about Biden&rsquo;s age, and the experience that derives from it. On the one hand, there&rsquo;s no doubt that his age is increasing anxiety among Democrats about his capacity to serve as an effective candidate for the presidency in 2024; on the other, his experience is increasing Democratic faith in his capacity to serve as an effective president now.\r\n\r\nWhile more Democrats have been openly pining for another, younger alternative to replace Biden as the party&rsquo;s nominee next year, many party leaders argued that there was no one from the Democrats&rsquo; large 2020 field of presidential candidates, or even among the rising crop of governors and senators discussed as potential successors, that they would trust more at this moment than Biden.\r\n\r\n&ldquo;No one &ndash; not a one,&rdquo; said Matt Bennett, executive vice president for public affairs at Third Way, an organization of centrist Democrats. &ldquo;That is genuinely the case. And I get people&rsquo;s uneasiness about him both because he&rsquo;s old and he has low poll numbers. But that doesn&rsquo;t mean he isn&rsquo;t the best person for the job.&rdquo;\r\n\r\nFamiliarity with an issue is no guarantee of success: Biden took office with a long-standing determination to end the American deployment in Afghanistan but still executed a chaotic withdrawal. But in responding to global challenges, Biden, who was first elected to the Senate in 1972, is drawing on half a century of dealing with issues and players around the world; even George H.W. Bush, the last president who arrived in office with an extensive foreign policy pedigree, had only about two decades of previous high-level exposure to world events.\r\n\r\nThis latest crisis has offered more evidence that Biden is more proficient at the aspects of the presidency that unfold offstage than those that occur in public. It&rsquo;s probably not a coincidence that the private aspects of the presidency are the ones where experience is the greatest asset, while the public elements of the job are those where age may be the greatest burden.\r\n\r\nBiden&rsquo;s speeches about Ukraine, and especially his impassioned denunciations of the Hamas attack over the past two weeks, have drawn much stronger reviews than most of his addresses on domestic issues. (Bret Stephens, a conservative New York Times columnist often critical of Biden, wrote that his first speech after the attack &ldquo;deserves a place in any anthology of great American rhetoric.&rdquo;) In Biden&rsquo;s nationally televised address about Israel and Ukraine on Thursday, he drew on a long tradition of presidents from both parties who presented American international engagement as the key to world stability, even quoting Franklin D. Roosevelt&rsquo;s call during World War II for the US to serve as the &ldquo;arsenal of democracy.&rdquo;\r\n\r\nBut even when Biden was younger, delivering galvanizing speeches was never his greatest strength. No one ever confused him with Ronald Reagan, Bill Clinton or Barack Obama as a communicator and his performance as president hasn&rsquo;t changed that verdict. Instead, Biden has been at his best when working with other leaders, at home and abroad, out of the public eye.\r\n\r\nBiden, for instance, passed more consequential legislation than almost anyone expected during his first two years, but he did not do so by rallying public sentiment or barnstorming the country. Rather, in quiet meetings, he helped to orchestrate a surprisingly effective legislative minuet that produced bipartisan agreements on infrastructure and promoting semiconductor manufacturing before culminating in a stunning agreement with holdout Democratic Sen. Joe Manchin of West Virginia to pass an expansive package of clean energy and health care initiatives with Democrat votes alone.\r\n\r\n&ldquo;He&rsquo;s showed a degree of political dexterity in managing the coalition that would have been very challenging for anyone else,&rdquo; said Rosenberg. &ldquo;His years of actually legislating, where he learned how to bring people together and hash stuff out, was really important in keeping the Democratic family together.&rdquo;\r\n\r\nTo the degree Biden has succeeded in international affairs, it has largely been with the same formula of working offstage with other leaders, many of whom he&rsquo;s known for years, around issues that he has also worked on for years. In the most dramatic example, that sort of private negotiation and collaboration has produced a surprisingly broad and durable international coalition of nations supporting Ukraine against Russia.\r\n\r\nBiden&rsquo;s effort to manage this latest Mideast crisis is centered on his attempts through private diplomacy to support Israel in its determination to disable Hamas, while minimizing the risk of a wider war and maintaining the possibility of diplomatic agreements after the fighting (including, most importantly, a rapprochement between Israel and Saudi Arabia meant to counter Iranian influence). Administration officials believe that the strong support that Biden has expressed for Israel, not only after the latest attack, but through his long career, has provided him with a credibility among the Israeli public that will increase his leverage to influence, and perhaps restrain, the decisions of Israeli Prime Minister Benjamin Netanyahu.\r\n\r\nThe president &ldquo;wisely from the very moment of this horror show expressed unfettered solidarity with Israel and that allowed him to then go to Israel and behind closed doors continue the conversation, which I&rsquo;m sure Secretary [Antony] Blinken started,&rdquo; said one former senior national security official in the Biden administration, who asked to be anonymous while discussing the situation. That credibility, the former official said, allowed Biden to ask hard questions of the Israelis such as &ldquo;&lsquo;Ok, you are going to send in ground troops and then what? We did shock and awe [in the second Iraq war] and then we found ourselves trapped without a plan. What are you doing? What&rsquo;s the outcome? Who is going to control Gaza when you&rsquo;re done whatever you are doing? At least stop and think about this.&rsquo;&rdquo;\r\n\r\nIn all these ways, the Israel confrontation offers Biden an opportunity to highlight the aspects of the presidency for which he is arguably best suited. In the crisis&rsquo; first days, former President Trump also provided Biden exactly the sort of personal contrast Democrats want to create when Trump initially responded to the tragic Hamas attack by airing personal grievances against Netanyahu and criticizing the Israeli response to the attack. For some Democrats, Trump&rsquo;s off-key response crystallized the contrast they want to present next year to voters: &ldquo;Biden is quiet competence and Trump is chaos and it&rsquo;s a real choice,&rdquo; said Jenifer Fernandez Ancona, vice president and chief strategy officer at Way to Win, a liberal group that funds organizations and campaigns focusing on voters of color.\r\n\r\nAncona said Biden&rsquo;s performance since the Hamas attack points to the case Democrats should be preparing to make to voters in 2024. &ldquo;He&rsquo;s been a workhorse not a show pony, but that&rsquo;s something we can talk about,&rdquo; she said. &ldquo;You can show a picture of a president working quietly behind the scenes, you can tell a story of how he has your best interests at heart. It is what it is: he&rsquo;s, what, 80? You can&rsquo;t get around that. But I do think he has shown he has the capacity and strength and tenacity to do this job. He&rsquo;s been doing it. So why shouldn&rsquo;t he get a chance to keep doing it?&rdquo;\r\n\r\nLikewise, Rosenberg argues, &ldquo;In my view you can&rsquo;t separate his age from his successes as president. He&rsquo;s been successful because of his age and experience not in spite of it, and we have to rethink that completely.&rdquo;\r\n\r\nOther Democrats, though, aren&rsquo;t sure that Biden can neutralize concerns about his age by making a case for the benefits of his experience. One Democratic pollster familiar with thinking in the Biden campaign, who asked for anonymity while discussing the 2024 landscape, said that highlighting Biden&rsquo;s experience would only produce limited value for him so long as most voters are dissatisfied with conditions in the country. &ldquo;The problem with the experience side is that people feel bad,&rdquo; the pollster said. &ldquo;If people felt like his accomplishments improved things for them, they wouldn&rsquo;t care about his age. &hellip; The problem with the age vs. experience [argument] is that experience has to produce results for them, but experience isn&rsquo;t producing results.&rdquo;\r\n\r\nWilliam Galston, a senior fellow at the Brookings Institution and long-time Democratic strategist, sees another limit to the experience argument. Like most Democrats, Galston believes that Biden&rsquo;s response to the crisis has, in fact, demonstrated the value of his long track record on international issues. &ldquo;This is where all of his instincts, honed by decades of experience, come into play,&rdquo; Galston said. &ldquo;He knows which people to call when; he knows whom to send where. As was the case in [Ukraine], this is the sort of episode where Biden is at his best.&rdquo;\r\n\r\nThe problem, Galston argues, is that voters can see the value of Biden&rsquo;s experience in dealing with world events today and still worry he could not effectively handle the presidency for another term. &ldquo;It&rsquo;s not a logical contradiction,&rdquo; Galston said, for voters to believe that &ldquo;&lsquo;Yes, over the first four years of his presidency, his experience proved its value, and he had enough energy and focus to be able to draw on it when he needed it&rsquo; and at the same time say, &lsquo;I am very worried that over the next four years, in the tension between the advantages of experience and disadvantages of age, that balance is going to shift against him.&rsquo;&rdquo;\r\n\r\nTo assuage concerns about his capacity, Biden will need not only to &ldquo;tell&rdquo; voters about the value of his experience but to &ldquo;show&rdquo; them his vigor through a rigorous campaign schedule, Galston said. &ldquo;The experience argument is necessary, but not sufficient,&rdquo; Galston maintains. &ldquo;In addition to that argument, assuming it can be made well and convincingly, I think he is going to have to show through his conduct of the campaign that he&rsquo;s up for another four years.&rdquo;\r\n\r\nBiden&rsquo;s trips into active war zones in Ukraine and Israel have provided dramatic images that his campaign is already using to make that case. As Galston suggests, the president will surely need to prove the point again repeatedly in 2024.\r\n\r\nBut most analysts agree that what the president most needs to demonstrate in the months ahead is not energy, but results. His supporters have reason for optimism that Biden&rsquo;s carefully calibrated response to the Israel-Hamas hostilities will allow them to present him as a reassuring source of stability in an unstable world &ndash; in stark contrast to the unpredictability and chaos that Trump, his most likely 2024 opponent, perpetually generates. But Biden&rsquo;s management of this volatile conflict will help him make that argument only if its outcome, in fact, promotes greater stability in the Middle East. If nothing else, Biden&rsquo;s long experience has surely taught him how difficult stability will be to achieve in a region once again teetering on the edge of explosion."}]